; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/sokoban/domain.pddl
;; updates:
;;   - only focus on microban instances, hence 4 constant directions
;;
(define (domain sokoban)
(:requirements :typing)
(:types location direction box)

(:constants down up left right - direction)

(:predicates
             (at-robot ?l - location)
             (at ?o - box ?l - location)
             (adjacent ?l1 - location ?l2 - location ?d - direction) 
             (clear ?l - location)
)

(:action move
:parameters (?from - location ?to - location ?dir - direction)
:precondition (and (clear ?to) (at-robot ?from) (adjacent ?from ?to ?dir))
:effect (and (at-robot ?to) (not (at-robot ?from)))
)
             

(:action push
:parameters  (?rloc - location ?bloc - location ?floc - location ?dir - direction ?b - box)
:precondition (and (at-robot ?rloc) (at ?b ?bloc) (clear ?floc)
	           (adjacent ?rloc ?bloc ?dir) (adjacent ?bloc ?floc ?dir))

:effect (and (at-robot ?bloc) (at ?b ?floc) (clear ?bloc)
             (not (at-robot ?rloc)) (not (at ?b ?bloc)) (not (clear ?floc)))
)
)

; problem
;; grid_size=13, boxes=4, out_folder=training/easy, instance_id=92, seed=121
;;
;;   #  #  #  #  #  #  #  #  #  #  #  #  #
;;   #  .  #  .  .  #  .  .  .  . R+  .  #
;;   #  .  #  #  .  #  G  +  +  #  +  .  #
;;   #  .  +  +  +  G  +  +  +  #  +  .  #
;;   #  # 4+  +  +  +  +  +  #  .  +  .  #
;;   #  .  G  +  #  + 2+  +  .  .  +  #  #
;;   #  #  +  +  #  +  +  +  .  .  +  #  #
;;   #  .  .  +  +  +  +  +  +  +  +  #  #
;;   #  #  # 3+  #  #  .  +  .  #  #  #  #
;;   #  #  +  +  +  .  . 1+  #  .  #  #  #
;;   #  .  G  +  +  +  +  +  #  #  .  .  #
;;   #  #  #  #  .  #  #  .  #  .  .  #  #
;;   #  #  #  #  #  #  #  #  #  #  #  #  #
;; 

(define (problem sokoban-92)
 (:domain sokoban)
 (:objects 
    loc_1_1 loc_1_2 loc_1_3 loc_1_4 loc_1_5 loc_1_6 loc_1_7 loc_1_8 loc_1_9 loc_1_10 loc_1_11 loc_1_12 loc_1_13 loc_2_1 loc_2_2 loc_2_3 loc_2_4 loc_2_5 loc_2_6 loc_2_7 loc_2_8 loc_2_9 loc_2_10 loc_2_11 loc_2_12 loc_2_13 loc_3_1 loc_3_2 loc_3_3 loc_3_4 loc_3_5 loc_3_6 loc_3_7 loc_3_8 loc_3_9 loc_3_10 loc_3_11 loc_3_12 loc_3_13 loc_4_1 loc_4_2 loc_4_3 loc_4_4 loc_4_5 loc_4_6 loc_4_7 loc_4_8 loc_4_9 loc_4_10 loc_4_11 loc_4_12 loc_4_13 loc_5_1 loc_5_2 loc_5_3 loc_5_4 loc_5_5 loc_5_6 loc_5_7 loc_5_8 loc_5_9 loc_5_10 loc_5_11 loc_5_12 loc_5_13 loc_6_1 loc_6_2 loc_6_3 loc_6_4 loc_6_5 loc_6_6 loc_6_7 loc_6_8 loc_6_9 loc_6_10 loc_6_11 loc_6_12 loc_6_13 loc_7_1 loc_7_2 loc_7_3 loc_7_4 loc_7_5 loc_7_6 loc_7_7 loc_7_8 loc_7_9 loc_7_10 loc_7_11 loc_7_12 loc_7_13 loc_8_1 loc_8_2 loc_8_3 loc_8_4 loc_8_5 loc_8_6 loc_8_7 loc_8_8 loc_8_9 loc_8_10 loc_8_11 loc_8_12 loc_8_13 loc_9_1 loc_9_2 loc_9_3 loc_9_4 loc_9_5 loc_9_6 loc_9_7 loc_9_8 loc_9_9 loc_9_10 loc_9_11 loc_9_12 loc_9_13 loc_10_1 loc_10_2 loc_10_3 loc_10_4 loc_10_5 loc_10_6 loc_10_7 loc_10_8 loc_10_9 loc_10_10 loc_10_11 loc_10_12 loc_10_13 loc_11_1 loc_11_2 loc_11_3 loc_11_4 loc_11_5 loc_11_6 loc_11_7 loc_11_8 loc_11_9 loc_11_10 loc_11_11 loc_11_12 loc_11_13 loc_12_1 loc_12_2 loc_12_3 loc_12_4 loc_12_5 loc_12_6 loc_12_7 loc_12_8 loc_12_9 loc_12_10 loc_12_11 loc_12_12 loc_12_13 loc_13_1 loc_13_2 loc_13_3 loc_13_4 loc_13_5 loc_13_6 loc_13_7 loc_13_8 loc_13_9 loc_13_10 loc_13_11 loc_13_12 loc_13_13 - location
    box1 box2 box3 box4 - box
    )
 (:init 

    (at-robot loc_2_11)
    (at box3 loc_9_4)
    (at box1 loc_10_8)
    (at box4 loc_5_3)
    (at box2 loc_6_7)
    (clear loc_5_10)
    (clear loc_6_2)
    (clear loc_6_11)
    (clear loc_11_7)
    (clear loc_3_12)
    (clear loc_7_3)
    (clear loc_8_2)
    (clear loc_8_11)
    (clear loc_4_7)
    (clear loc_6_4)
    (clear loc_12_8)
    (clear loc_3_5)
    (clear loc_2_9)
    (clear loc_8_4)
    (clear loc_4_9)
    (clear loc_6_6)
    (clear loc_10_4)
    (clear loc_12_10)
    (clear loc_2_11)
    (clear loc_7_7)
    (clear loc_8_6)
    (clear loc_4_2)
    (clear loc_4_11)
    (clear loc_6_8)
    (clear loc_10_6)
    (clear loc_2_4)
    (clear loc_8_8)
    (clear loc_4_4)
    (clear loc_6_10)
    (clear loc_5_12)
    (clear loc_12_5)
    (clear loc_8_10)
    (clear loc_4_6)
    (clear loc_6_3)
    (clear loc_5_5)
    (clear loc_10_10)
    (clear loc_11_2)
    (clear loc_11_11)
    (clear loc_2_8)
    (clear loc_3_7)
    (clear loc_8_3)
    (clear loc_4_8)
    (clear loc_5_7)
    (clear loc_10_3)
    (clear loc_9_7)
    (clear loc_11_4)
    (clear loc_2_10)
    (clear loc_3_9)
    (clear loc_8_5)
    (clear loc_7_9)
    (clear loc_9_9)
    (clear loc_11_6)
    (clear loc_3_2)
    (clear loc_2_12)
    (clear loc_3_11)
    (clear loc_7_11)
    (clear loc_4_3)
    (clear loc_4_12)
    (clear loc_5_11)
    (clear loc_11_8)
    (clear loc_2_5)
    (clear loc_7_4)
    (clear loc_4_5)
    (clear loc_5_4)
    (clear loc_2_7)
    (clear loc_7_6)
    (clear loc_5_6)
    (clear loc_11_3)
    (clear loc_10_5)
    (clear loc_11_12)
    (clear loc_12_11)
    (clear loc_3_8)
    (clear loc_7_8)
    (clear loc_8_7)
    (clear loc_5_8)
    (clear loc_6_9)
    (clear loc_9_8)
    (clear loc_11_5)
    (clear loc_2_2)
    (clear loc_10_7)
    (clear loc_7_10)
    (clear loc_8_9)
    (adjacent loc_2_2 loc_3_2 down)
    (adjacent loc_2_4 loc_2_5 right)
    (adjacent loc_2_5 loc_3_5 down)
    (adjacent loc_2_5 loc_2_4 left)
    (adjacent loc_2_7 loc_3_7 down)
    (adjacent loc_2_7 loc_2_8 right)
    (adjacent loc_2_8 loc_3_8 down)
    (adjacent loc_2_8 loc_2_7 left)
    (adjacent loc_2_8 loc_2_9 right)
    (adjacent loc_2_9 loc_3_9 down)
    (adjacent loc_2_9 loc_2_8 left)
    (adjacent loc_2_9 loc_2_10 right)
    (adjacent loc_2_10 loc_2_9 left)
    (adjacent loc_2_10 loc_2_11 right)
    (adjacent loc_2_11 loc_3_11 down)
    (adjacent loc_2_11 loc_2_10 left)
    (adjacent loc_2_11 loc_2_12 right)
    (adjacent loc_2_12 loc_3_12 down)
    (adjacent loc_2_12 loc_2_11 left)
    (adjacent loc_3_2 loc_4_2 down)
    (adjacent loc_3_2 loc_2_2 up)
    (adjacent loc_3_5 loc_4_5 down)
    (adjacent loc_3_5 loc_2_5 up)
    (adjacent loc_3_7 loc_4_7 down)
    (adjacent loc_3_7 loc_2_7 up)
    (adjacent loc_3_7 loc_3_8 right)
    (adjacent loc_3_8 loc_4_8 down)
    (adjacent loc_3_8 loc_3_7 left)
    (adjacent loc_3_8 loc_2_8 up)
    (adjacent loc_3_8 loc_3_9 right)
    (adjacent loc_3_9 loc_4_9 down)
    (adjacent loc_3_9 loc_3_8 left)
    (adjacent loc_3_9 loc_2_9 up)
    (adjacent loc_3_11 loc_4_11 down)
    (adjacent loc_3_11 loc_2_11 up)
    (adjacent loc_3_11 loc_3_12 right)
    (adjacent loc_3_12 loc_4_12 down)
    (adjacent loc_3_12 loc_3_11 left)
    (adjacent loc_3_12 loc_2_12 up)
    (adjacent loc_4_2 loc_3_2 up)
    (adjacent loc_4_2 loc_4_3 right)
    (adjacent loc_4_3 loc_5_3 down)
    (adjacent loc_4_3 loc_4_2 left)
    (adjacent loc_4_3 loc_4_4 right)
    (adjacent loc_4_4 loc_5_4 down)
    (adjacent loc_4_4 loc_4_3 left)
    (adjacent loc_4_4 loc_4_5 right)
    (adjacent loc_4_5 loc_5_5 down)
    (adjacent loc_4_5 loc_4_4 left)
    (adjacent loc_4_5 loc_3_5 up)
    (adjacent loc_4_5 loc_4_6 right)
    (adjacent loc_4_6 loc_5_6 down)
    (adjacent loc_4_6 loc_4_5 left)
    (adjacent loc_4_6 loc_4_7 right)
    (adjacent loc_4_7 loc_5_7 down)
    (adjacent loc_4_7 loc_4_6 left)
    (adjacent loc_4_7 loc_3_7 up)
    (adjacent loc_4_7 loc_4_8 right)
    (adjacent loc_4_8 loc_5_8 down)
    (adjacent loc_4_8 loc_4_7 left)
    (adjacent loc_4_8 loc_3_8 up)
    (adjacent loc_4_8 loc_4_9 right)
    (adjacent loc_4_9 loc_4_8 left)
    (adjacent loc_4_9 loc_3_9 up)
    (adjacent loc_4_11 loc_5_11 down)
    (adjacent loc_4_11 loc_3_11 up)
    (adjacent loc_4_11 loc_4_12 right)
    (adjacent loc_4_12 loc_5_12 down)
    (adjacent loc_4_12 loc_4_11 left)
    (adjacent loc_4_12 loc_3_12 up)
    (adjacent loc_5_3 loc_6_3 down)
    (adjacent loc_5_3 loc_4_3 up)
    (adjacent loc_5_3 loc_5_4 right)
    (adjacent loc_5_4 loc_6_4 down)
    (adjacent loc_5_4 loc_5_3 left)
    (adjacent loc_5_4 loc_4_4 up)
    (adjacent loc_5_4 loc_5_5 right)
    (adjacent loc_5_5 loc_5_4 left)
    (adjacent loc_5_5 loc_4_5 up)
    (adjacent loc_5_5 loc_5_6 right)
    (adjacent loc_5_6 loc_6_6 down)
    (adjacent loc_5_6 loc_5_5 left)
    (adjacent loc_5_6 loc_4_6 up)
    (adjacent loc_5_6 loc_5_7 right)
    (adjacent loc_5_7 loc_6_7 down)
    (adjacent loc_5_7 loc_5_6 left)
    (adjacent loc_5_7 loc_4_7 up)
    (adjacent loc_5_7 loc_5_8 right)
    (adjacent loc_5_8 loc_6_8 down)
    (adjacent loc_5_8 loc_5_7 left)
    (adjacent loc_5_8 loc_4_8 up)
    (adjacent loc_5_10 loc_6_10 down)
    (adjacent loc_5_10 loc_5_11 right)
    (adjacent loc_5_11 loc_6_11 down)
    (adjacent loc_5_11 loc_5_10 left)
    (adjacent loc_5_11 loc_4_11 up)
    (adjacent loc_5_11 loc_5_12 right)
    (adjacent loc_5_12 loc_5_11 left)
    (adjacent loc_5_12 loc_4_12 up)
    (adjacent loc_6_2 loc_6_3 right)
    (adjacent loc_6_3 loc_7_3 down)
    (adjacent loc_6_3 loc_6_2 left)
    (adjacent loc_6_3 loc_5_3 up)
    (adjacent loc_6_3 loc_6_4 right)
    (adjacent loc_6_4 loc_7_4 down)
    (adjacent loc_6_4 loc_6_3 left)
    (adjacent loc_6_4 loc_5_4 up)
    (adjacent loc_6_6 loc_7_6 down)
    (adjacent loc_6_6 loc_5_6 up)
    (adjacent loc_6_6 loc_6_7 right)
    (adjacent loc_6_7 loc_7_7 down)
    (adjacent loc_6_7 loc_6_6 left)
    (adjacent loc_6_7 loc_5_7 up)
    (adjacent loc_6_7 loc_6_8 right)
    (adjacent loc_6_8 loc_7_8 down)
    (adjacent loc_6_8 loc_6_7 left)
    (adjacent loc_6_8 loc_5_8 up)
    (adjacent loc_6_8 loc_6_9 right)
    (adjacent loc_6_9 loc_7_9 down)
    (adjacent loc_6_9 loc_6_8 left)
    (adjacent loc_6_9 loc_6_10 right)
    (adjacent loc_6_10 loc_7_10 down)
    (adjacent loc_6_10 loc_6_9 left)
    (adjacent loc_6_10 loc_5_10 up)
    (adjacent loc_6_10 loc_6_11 right)
    (adjacent loc_6_11 loc_7_11 down)
    (adjacent loc_6_11 loc_6_10 left)
    (adjacent loc_6_11 loc_5_11 up)
    (adjacent loc_7_3 loc_8_3 down)
    (adjacent loc_7_3 loc_6_3 up)
    (adjacent loc_7_3 loc_7_4 right)
    (adjacent loc_7_4 loc_8_4 down)
    (adjacent loc_7_4 loc_7_3 left)
    (adjacent loc_7_4 loc_6_4 up)
    (adjacent loc_7_6 loc_8_6 down)
    (adjacent loc_7_6 loc_6_6 up)
    (adjacent loc_7_6 loc_7_7 right)
    (adjacent loc_7_7 loc_8_7 down)
    (adjacent loc_7_7 loc_7_6 left)
    (adjacent loc_7_7 loc_6_7 up)
    (adjacent loc_7_7 loc_7_8 right)
    (adjacent loc_7_8 loc_8_8 down)
    (adjacent loc_7_8 loc_7_7 left)
    (adjacent loc_7_8 loc_6_8 up)
    (adjacent loc_7_8 loc_7_9 right)
    (adjacent loc_7_9 loc_8_9 down)
    (adjacent loc_7_9 loc_7_8 left)
    (adjacent loc_7_9 loc_6_9 up)
    (adjacent loc_7_9 loc_7_10 right)
    (adjacent loc_7_10 loc_8_10 down)
    (adjacent loc_7_10 loc_7_9 left)
    (adjacent loc_7_10 loc_6_10 up)
    (adjacent loc_7_10 loc_7_11 right)
    (adjacent loc_7_11 loc_8_11 down)
    (adjacent loc_7_11 loc_7_10 left)
    (adjacent loc_7_11 loc_6_11 up)
    (adjacent loc_8_2 loc_8_3 right)
    (adjacent loc_8_3 loc_8_2 left)
    (adjacent loc_8_3 loc_7_3 up)
    (adjacent loc_8_3 loc_8_4 right)
    (adjacent loc_8_4 loc_9_4 down)
    (adjacent loc_8_4 loc_8_3 left)
    (adjacent loc_8_4 loc_7_4 up)
    (adjacent loc_8_4 loc_8_5 right)
    (adjacent loc_8_5 loc_8_4 left)
    (adjacent loc_8_5 loc_8_6 right)
    (adjacent loc_8_6 loc_8_5 left)
    (adjacent loc_8_6 loc_7_6 up)
    (adjacent loc_8_6 loc_8_7 right)
    (adjacent loc_8_7 loc_9_7 down)
    (adjacent loc_8_7 loc_8_6 left)
    (adjacent loc_8_7 loc_7_7 up)
    (adjacent loc_8_7 loc_8_8 right)
    (adjacent loc_8_8 loc_9_8 down)
    (adjacent loc_8_8 loc_8_7 left)
    (adjacent loc_8_8 loc_7_8 up)
    (adjacent loc_8_8 loc_8_9 right)
    (adjacent loc_8_9 loc_9_9 down)
    (adjacent loc_8_9 loc_8_8 left)
    (adjacent loc_8_9 loc_7_9 up)
    (adjacent loc_8_9 loc_8_10 right)
    (adjacent loc_8_10 loc_8_9 left)
    (adjacent loc_8_10 loc_7_10 up)
    (adjacent loc_8_10 loc_8_11 right)
    (adjacent loc_8_11 loc_8_10 left)
    (adjacent loc_8_11 loc_7_11 up)
    (adjacent loc_9_4 loc_10_4 down)
    (adjacent loc_9_4 loc_8_4 up)
    (adjacent loc_9_7 loc_10_7 down)
    (adjacent loc_9_7 loc_8_7 up)
    (adjacent loc_9_7 loc_9_8 right)
    (adjacent loc_9_8 loc_10_8 down)
    (adjacent loc_9_8 loc_9_7 left)
    (adjacent loc_9_8 loc_8_8 up)
    (adjacent loc_9_8 loc_9_9 right)
    (adjacent loc_9_9 loc_9_8 left)
    (adjacent loc_9_9 loc_8_9 up)
    (adjacent loc_10_3 loc_11_3 down)
    (adjacent loc_10_3 loc_10_4 right)
    (adjacent loc_10_4 loc_11_4 down)
    (adjacent loc_10_4 loc_10_3 left)
    (adjacent loc_10_4 loc_9_4 up)
    (adjacent loc_10_4 loc_10_5 right)
    (adjacent loc_10_5 loc_11_5 down)
    (adjacent loc_10_5 loc_10_4 left)
    (adjacent loc_10_5 loc_10_6 right)
    (adjacent loc_10_6 loc_11_6 down)
    (adjacent loc_10_6 loc_10_5 left)
    (adjacent loc_10_6 loc_10_7 right)
    (adjacent loc_10_7 loc_11_7 down)
    (adjacent loc_10_7 loc_10_6 left)
    (adjacent loc_10_7 loc_9_7 up)
    (adjacent loc_10_7 loc_10_8 right)
    (adjacent loc_10_8 loc_11_8 down)
    (adjacent loc_10_8 loc_10_7 left)
    (adjacent loc_10_8 loc_9_8 up)
    (adjacent loc_11_2 loc_11_3 right)
    (adjacent loc_11_3 loc_11_2 left)
    (adjacent loc_11_3 loc_10_3 up)
    (adjacent loc_11_3 loc_11_4 right)
    (adjacent loc_11_4 loc_11_3 left)
    (adjacent loc_11_4 loc_10_4 up)
    (adjacent loc_11_4 loc_11_5 right)
    (adjacent loc_11_5 loc_12_5 down)
    (adjacent loc_11_5 loc_11_4 left)
    (adjacent loc_11_5 loc_10_5 up)
    (adjacent loc_11_5 loc_11_6 right)
    (adjacent loc_11_6 loc_11_5 left)
    (adjacent loc_11_6 loc_10_6 up)
    (adjacent loc_11_6 loc_11_7 right)
    (adjacent loc_11_7 loc_11_6 left)
    (adjacent loc_11_7 loc_10_7 up)
    (adjacent loc_11_7 loc_11_8 right)
    (adjacent loc_11_8 loc_12_8 down)
    (adjacent loc_11_8 loc_11_7 left)
    (adjacent loc_11_8 loc_10_8 up)
    (adjacent loc_11_11 loc_12_11 down)
    (adjacent loc_11_11 loc_11_12 right)
    (adjacent loc_11_12 loc_11_11 left)
    (adjacent loc_12_5 loc_11_5 up)
    (adjacent loc_12_8 loc_11_8 up)
    (adjacent loc_12_10 loc_12_11 right)
    (adjacent loc_12_11 loc_12_10 left)
    (adjacent loc_12_11 loc_11_11 up))
 (:goal  (and 
    (at box1 loc_3_7)
    (at box2 loc_4_6)
    (at box3 loc_11_3)
    (at box4 loc_6_3))))

; plan
1. (move loc_2_11 loc_2_10 left)
   deleted: (at-robot loc_2_11)
   added: (at-robot loc_2_10)
   goals met: 0 of 4
2. (move loc_2_10 loc_2_9 left)
   deleted: (at-robot loc_2_10)
   added: (at-robot loc_2_9)
   goals met: 0 of 4
3. (move loc_2_9 loc_3_9 down)
   deleted: (at-robot loc_2_9)
   added: (at-robot loc_3_9)
   goals met: 0 of 4
4. (move loc_3_9 loc_4_9 down)
   deleted: (at-robot loc_3_9)
   added: (at-robot loc_4_9)
   goals met: 0 of 4
5. (move loc_4_9 loc_4_8 left)
   deleted: (at-robot loc_4_9)
   added: (at-robot loc_4_8)
   goals met: 0 of 4
6. (move loc_4_8 loc_5_8 down)
   deleted: (at-robot loc_4_8)
   added: (at-robot loc_5_8)
   goals met: 0 of 4
7. (move loc_5_8 loc_6_8 down)
   deleted: (at-robot loc_5_8)
   added: (at-robot loc_6_8)
   goals met: 0 of 4
8. (push loc_6_8 loc_6_7 loc_6_6 left box2)
   deleted: (at-robot loc_6_8) (at box2 loc_6_7) (clear loc_6_6)
   added: (at-robot loc_6_7) (at box2 loc_6_6) (clear loc_6_7)
   goals met: 0 of 4
9. (move loc_6_7 loc_7_7 down)
   deleted: (at-robot loc_6_7)
   added: (at-robot loc_7_7)
   goals met: 0 of 4
10. (move loc_7_7 loc_7_6 left)
   deleted: (at-robot loc_7_7)
   added: (at-robot loc_7_6)
   goals met: 0 of 4
11. (push loc_7_6 loc_6_6 loc_5_6 up box2)
   deleted: (at-robot loc_7_6) (at box2 loc_6_6) (clear loc_5_6)
   added: (at-robot loc_6_6) (at box2 loc_5_6) (clear loc_6_6)
   goals met: 0 of 4
12. (push loc_6_6 loc_5_6 loc_4_6 up box2)
   deleted: (at-robot loc_6_6) (at box2 loc_5_6) (clear loc_4_6)
   added: (at-robot loc_5_6) (at box2 loc_4_6) (clear loc_5_6)
   goals met: 1 of 4
13. (move loc_5_6 loc_5_5 left)
   deleted: (at-robot loc_5_6)
   added: (at-robot loc_5_5)
   goals met: 1 of 4
14. (move loc_5_5 loc_5_4 left)
   deleted: (at-robot loc_5_5)
   added: (at-robot loc_5_4)
   goals met: 1 of 4
15. (move loc_5_4 loc_4_4 up)
   deleted: (at-robot loc_5_4)
   added: (at-robot loc_4_4)
   goals met: 1 of 4
16. (move loc_4_4 loc_4_3 left)
   deleted: (at-robot loc_4_4)
   added: (at-robot loc_4_3)
   goals met: 1 of 4
17. (push loc_4_3 loc_5_3 loc_6_3 down box4)
   deleted: (at-robot loc_4_3) (at box4 loc_5_3) (clear loc_6_3)
   added: (at-robot loc_5_3) (at box4 loc_6_3) (clear loc_5_3)
   goals met: 2 of 4
18. (move loc_5_3 loc_5_4 right)
   deleted: (at-robot loc_5_3)
   added: (at-robot loc_5_4)
   goals met: 2 of 4
19. (move loc_5_4 loc_6_4 down)
   deleted: (at-robot loc_5_4)
   added: (at-robot loc_6_4)
   goals met: 2 of 4
20. (move loc_6_4 loc_7_4 down)
   deleted: (at-robot loc_6_4)
   added: (at-robot loc_7_4)
   goals met: 2 of 4
21. (move loc_7_4 loc_8_4 down)
   deleted: (at-robot loc_7_4)
   added: (at-robot loc_8_4)
   goals met: 2 of 4
22. (push loc_8_4 loc_9_4 loc_10_4 down box3)
   deleted: (at-robot loc_8_4) (at box3 loc_9_4) (clear loc_10_4)
   added: (at-robot loc_9_4) (at box3 loc_10_4) (clear loc_9_4)
   goals met: 2 of 4
23. (push loc_9_4 loc_10_4 loc_11_4 down box3)
   deleted: (at-robot loc_9_4) (at box3 loc_10_4) (clear loc_11_4)
   added: (at-robot loc_10_4) (at box3 loc_11_4) (clear loc_10_4)
   goals met: 2 of 4
24. (move loc_10_4 loc_10_5 right)
   deleted: (at-robot loc_10_4)
   added: (at-robot loc_10_5)
   goals met: 2 of 4
25. (move loc_10_5 loc_11_5 down)
   deleted: (at-robot loc_10_5)
   added: (at-robot loc_11_5)
   goals met: 2 of 4
26. (push loc_11_5 loc_11_4 loc_11_3 left box3)
   deleted: (at-robot loc_11_5) (at box3 loc_11_4) (clear loc_11_3)
   added: (at-robot loc_11_4) (at box3 loc_11_3) (clear loc_11_4)
   goals met: 3 of 4
27. (move loc_11_4 loc_11_5 right)
   deleted: (at-robot loc_11_4)
   added: (at-robot loc_11_5)
   goals met: 3 of 4
28. (move loc_11_5 loc_11_6 right)
   deleted: (at-robot loc_11_5)
   added: (at-robot loc_11_6)
   goals met: 3 of 4
29. (move loc_11_6 loc_11_7 right)
   deleted: (at-robot loc_11_6)
   added: (at-robot loc_11_7)
   goals met: 3 of 4
30. (move loc_11_7 loc_11_8 right)
   deleted: (at-robot loc_11_7)
   added: (at-robot loc_11_8)
   goals met: 3 of 4
31. (push loc_11_8 loc_10_8 loc_9_8 up box1)
   deleted: (at-robot loc_11_8) (at box1 loc_10_8) (clear loc_9_8)
   added: (at-robot loc_10_8) (at box1 loc_9_8) (clear loc_10_8)
   goals met: 3 of 4
32. (push loc_10_8 loc_9_8 loc_8_8 up box1)
   deleted: (at-robot loc_10_8) (at box1 loc_9_8) (clear loc_8_8)
   added: (at-robot loc_9_8) (at box1 loc_8_8) (clear loc_9_8)
   goals met: 3 of 4
33. (push loc_9_8 loc_8_8 loc_7_8 up box1)
   deleted: (at-robot loc_9_8) (at box1 loc_8_8) (clear loc_7_8)
   added: (at-robot loc_8_8) (at box1 loc_7_8) (clear loc_8_8)
   goals met: 3 of 4
34. (push loc_8_8 loc_7_8 loc_6_8 up box1)
   deleted: (at-robot loc_8_8) (at box1 loc_7_8) (clear loc_6_8)
   added: (at-robot loc_7_8) (at box1 loc_6_8) (clear loc_7_8)
   goals met: 3 of 4
35. (push loc_7_8 loc_6_8 loc_5_8 up box1)
   deleted: (at-robot loc_7_8) (at box1 loc_6_8) (clear loc_5_8)
   added: (at-robot loc_6_8) (at box1 loc_5_8) (clear loc_6_8)
   goals met: 3 of 4
36. (push loc_6_8 loc_5_8 loc_4_8 up box1)
   deleted: (at-robot loc_6_8) (at box1 loc_5_8) (clear loc_4_8)
   added: (at-robot loc_5_8) (at box1 loc_4_8) (clear loc_5_8)
   goals met: 3 of 4
37. (push loc_5_8 loc_4_8 loc_3_8 up box1)
   deleted: (at-robot loc_5_8) (at box1 loc_4_8) (clear loc_3_8)
   added: (at-robot loc_4_8) (at box1 loc_3_8) (clear loc_4_8)
   goals met: 3 of 4
38. (move loc_4_8 loc_4_9 right)
   deleted: (at-robot loc_4_8)
   added: (at-robot loc_4_9)
   goals met: 3 of 4
39. (move loc_4_9 loc_3_9 up)
   deleted: (at-robot loc_4_9)
   added: (at-robot loc_3_9)
   goals met: 3 of 4
40. (push loc_3_9 loc_3_8 loc_3_7 left box1)
   deleted: (at-robot loc_3_9) (at box1 loc_3_8) (clear loc_3_7)
   added: (at-robot loc_3_8) (at box1 loc_3_7) (clear loc_3_8)
   goals met: 4 of 4
